package cn.pfc.myapplication.util;

public class StringUtil {
    public static String BASE_URL = "https://gwpre.sina.cn/interface/fymap2020_data.json?random=0.9268957923795904&_=1582259706740&callback=blankCallBack";
    public static int DAI_KOU_ZHAO_VIDEO = 0x000001;
    public static int XI_SHOU_VIDEO = 0x000002;
    public static int FANG_YI_VIDEO = 0x000003;


    public static String question = "[\n" +
            "\t{\n" +
            "\t\"question\":\"新型冠状病毒会人传人吗？\",\n" +
            "\t\"option\":[\n" +
            "\t\t\"会，虽然来源不明确，但具备在人与人之间传播的能力。\",\n" +
            "\t\t\"不会，主要是动物之间的传播。\"\n" +
            "\t],\n" +
            "\t\"answer\":\"会，虽然来源不明确，但具备在人与人之间传播的能力。\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"与新型冠状病毒患者近距离接触过，需要隔离多少天？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"2-3天\",\n" +
            "\t\t\t\"7天\",\n" +
            "\t\t\t\"14天\",\n" +
            "\t\t\t\" 21天\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"14天\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"《中华人民共和国传染病防治法》规定管理的传染病分甲、乙、丙三类，原有39种。甲类传染病是指传染性强、病死率高、易引起大流行的烈性传染病。2020年1月20日，经国务院批准，新型冠状病毒感染的肺炎新纳入《中华人民共和国传染病防治法》规定的（ ）传染病，采取（ ）传染病的防控措施进行管理。\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"甲类;甲类\",\n" +
            "\t\t\t\"乙类 ;甲类\",\n" +
            "\t\t\t\"甲类 ;乙类\",\n" +
            "\t\t\t\"乙类; 乙类\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"乙类 ;甲类\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"怎样正确戴口罩？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"要分清口罩的内外、上下，浅色面朝外，深色面朝内\",\n" +
            "\t\t\t\"为了节约，口罩可以两面轮流佩戴\",\n" +
            "\t\t\t\"戴口罩时，要将折面完全展开，完全包住嘴、鼻、下颌，然后压紧鼻夹，使口罩与面部完全贴合\",\n" +
            "\t\t\t\"将口罩有金属条（鼻夹）的一端戴在下方\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"戴口罩时，要将折面完全展开，完全包住嘴、鼻、下颌，然后压紧鼻夹，使口罩与面部完全贴合\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"室内用食用醋能杀灭新型冠状病毒？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"能，食用醋有杀菌消毒效果\",\n" +
            "\t\t\t\"不能，食用醋所含醋酸浓度很低，达不到消毒效果，同时易对人的眼睛和呼吸道造成刺激\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"不能，食用醋所含醋酸浓度很低，达不到消毒效果，同时易对人的眼睛和呼吸道造成刺激\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"吃抗病毒药物，如磷酸奥司他韦等能预防新型冠状病毒感染吗？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"能，磷酸奥司他韦是抗病毒药物，网络上也流传着这一药方\",\n" +
            "\t\t\t\"不能，虽然磷酸奥司他韦是抗病毒药物，但目前没有证据显示其能够预防新型冠状病毒感染\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"不能，虽然磷酸奥司他韦是抗病毒药物，但目前没有证据显示其能够预防新型冠状病毒感染\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"吃抗生素能预防新型冠状病毒感染吗？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"能，这是发烧感冒时最管用的药\",\n" +
            "\t\t\t\"不能，新型冠状病毒感染的肺炎病原体是病毒，而抗生素针对的是细菌。如以预防为目的，错误使用抗生素会增强病原体的耐药性\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"不能，新型冠状病毒感染的肺炎病原体是病毒，而抗生素针对的是细菌。如以预防为目的，错误使用抗生素会增强病原体的耐药性\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"吃维生素C能预防新型冠状病毒感染吗？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"能，维生素C可以增强免疫力\",\n" +
            "\t\t\t\"不能，维生素C可帮助机体维持正常免疫功能，但不能增强免疫力，也没有抗病毒的作用\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"不能，维生素C可帮助机体维持正常免疫功能，但不能增强免疫力，也没有抗病毒的作用\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"此前接种了流感疫苗的人就不容易被新型冠状病毒感染了吗？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"是的，接种过流感疫苗的人不易被新型冠状病毒感染\",\n" +
            "\t\t\t\"不是，流感疫苗主要是预防流感的，对新型冠状病毒无预防作用，所以接种了流感疫苗仍有可能感染新型冠状病毒，也可能出现严重症状\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"不是，流感疫苗主要是预防流感的，对新型冠状病毒无预防作用，所以接种了流感疫苗仍有可能感染新型冠状病毒，也可能出现严重症状\"\n" +
            "\t},\n" +
            "\t{\n" +
            "\t\t\"question\":\"哪类人群感染新型冠状病毒后，病情进展相对更快，严重程度更高？\",\n" +
            "\t\t\"option\":[\n" +
            "\t\t\t\"中小学生\",\n" +
            "\t\t\t\"免疫功能较差的人群，例如老年人、孕产妇或存在肝肾功能障碍的人群\",\n" +
            "\t\t\t\"上班族\"\n" +
            "\t\t\t],\n" +
            "\t\t\"answer\":\"免疫功能较差的人群，例如老年人、孕产妇或存在肝肾功能障碍的人群\"\n" +
            "\t}\n" +
            "]";
}
